TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_СопоставлениеОбъектовВнешнихСистем/гкс_СопоставлениеОбъектовВнешнихСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_СопоставлениеОбъектовВнешнихСистем</name>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ИдентификаторыСинхронизируемыхОбъектов/гкс_ИдентификаторыСинхронизируемыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ИдентификаторыСинхронизируемыхОбъектов</name>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приложение</name>
    <type>
      <types>CatalogRef.гкс_УчастникиОбменаRMQ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_СопоставлениеОбъектовВнешнихСистем/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает соответствие между объектами в регистре гкс_ИдентификаторыСинхронизируемыхОбъектов
// и выполняет замену ссылок.
// 
// Параметры:
//  ПараметрыВыполнения - Структура:
//  	* Приложение - СправочникСсылка.гкс_УчастникиОбменаRMQ - участник обмена.
//  	* ТипСсылки - СправочникСсылка.ИдентификаторыОбъектовМетаданных - идентификатор таблицы обновляемых записей.
//  	* СопоставлениеОбъектов - ТаблицаЗначений - входящие данные для установки соответствия.
//  АдресРезультата - УникальныйИдентификатор - адрес во временном хранилище для сохранения результата.
Процедура ЗадатьСоответствиеМеждуОбъектами(ПараметрыВыполнения, Знач АдресРезультата = "") Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		НомераТаблиц = Новый Структура;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Приложение"				, ПараметрыВыполнения.Приложение);
		Запрос.УстановитьПараметр("СопоставлениеОбъектов"	, ПараметрыВыполнения.СопоставлениеОбъектов);
		Запрос.Текст = ТекстЗапросаДляЗаданияСопоставления(ПараметрыВыполнения.ТипСсылки, НомераТаблиц);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатЗапроса[НомераТаблиц.ИдентификаторыСоздание].Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		// Удалить устаревшие записи
		КоллекцияИдентификаторов = РезультатЗапроса[НомераТаблиц.ИдентификаторыУдаление].Выгрузить();
		НаборЗаписей = РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(КоллекцияИдентификаторов);
		НаборЗаписей.Записать(РежимЗамещения.Удаление);
		
		// Добавить новые записи
		КоллекцияИдентификаторов = РезультатЗапроса[НомераТаблиц.ИдентификаторыСоздание].Выгрузить();
		НаборЗаписей = РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(КоллекцияИдентификаторов);
		НаборЗаписей.Записать(РежимЗамещения.Слияние);
		
		// Обновить ссылки
		ЗаменитьСсылки(КоллекцияИдентификаторов, АдресРезультата);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке 				= ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки 	= ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КраткоеПредставлениеОшибки 		= ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Длительные операции.Ошибка выполнения'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки);
		ВызватьИсключение КраткоеПредставлениеОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаменитьСсылки(СопоставленныеОбъекты, Знач АдресРезультата = "") Экспорт
	
	ПараметрыЗаменыСсылок = ОбщегоНазначения.ПараметрыЗаменыСсылок();
	ПараметрыЗаменыСсылок.ВключатьБизнесЛогику 	= Ложь;
	
	ПарыЗамен = Новый Соответствие;
	Для Каждого СтрокаСоответствия Из СопоставленныеОбъекты Цикл
		ПарыЗамен.Вставить(СтрокаСоответствия.ЗаменяемаяСсылка, СтрокаСоответствия.Ссылка);
	КонецЦикла;
	
	Результат = ОбщегоНазначения.ЗаменитьСсылки(ПарыЗамен, ПараметрыЗаменыСсылок);
	Если АдресРезультата <> "" Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаДляЗаданияСопоставления(ТипСсылки, НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТСопоставлениеОбъектов"	, НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ИдентификаторыСоздание"	, НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ИдентификаторыУдаление"	, НомераТаблиц.Количество());
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СопоставлениеОбъектов.Ссылка КАК Ссылка,
	|	СопоставлениеОбъектов.ЗаменяемаяСсылка КАК ЗаменяемаяСсылка,
	|	СопоставлениеОбъектов.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ СопоставлениеОбъектов
	|ИЗ
	|	&СопоставлениеОбъектов КАК СопоставлениеОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Приложение КАК Приложение,
	|	ТаблицаИБ.Ссылка КАК Ссылка,
	|	СопоставлениеОбъектов.Идентификатор КАК Идентификатор,
	|	СопоставлениеОбъектов.ЗаменяемаяСсылка КАК ЗаменяемаяСсылка
	|ИЗ
	|	СопоставлениеОбъектов КАК СопоставлениеОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяТаблицыИБ КАК ТаблицаИБ
	|		ПО СопоставлениеОбъектов.Ссылка = ТаблицаИБ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыСинхронизируемыхОбъектов.Идентификатор КАК Идентификатор,
	|	ИдентификаторыСинхронизируемыхОбъектов.Ссылка КАК Ссылка,
	|	ИдентификаторыСинхронизируемыхОбъектов.Приложение КАК Приложение
	|ИЗ
	|	СопоставлениеОбъектов КАК СопоставлениеОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ИдентификаторыСинхронизируемыхОбъектов КАК
	|			ИдентификаторыСинхронизируемыхОбъектов
	|		ПО ИдентификаторыСинхронизируемыхОбъектов.Идентификатор = СопоставлениеОбъектов.Идентификатор
	|		И ИдентификаторыСинхронизируемыхОбъектов.Ссылка = СопоставлениеОбъектов.ЗаменяемаяСсылка
	|		И ИдентификаторыСинхронизируемыхОбъектов.Приложение = &Приложение";
	ИмяРеквизита = "ПолноеИмя";
	ПолноеИмяТаблицы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипСсылки, ИмяРеквизита);
	
	Возврат СтрЗаменить(ТекстЗапроса, "ИмяТаблицыИБ", ПолноеИмяТаблицы);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
